doc.org
#+STARTUP: showall indent hidestars

* Intro

Я делаю статический анализатор для Solidity - это язык
смарт-контрактов в Etherium. Цель в том чтобы искать уязвимости в
криво написанных контрактах.

Для удобства поиска по этой спецификации я использую систему
наименования, которая опирается на документацию по грамматике
Solidity. Каждое грамматическое правило, найденное в документации,
например ~constructor-definition~ описывается в своем разделе, но
чтобы не путать его при поиске он называется в UpperCamelCase, для
этого примера: ~СonstructorDefinition~.

Таким образом я сокращаю нетерминалы (например ~%ctract-def~ вместо
~%contract-definition~) но при этом терминалы не сокращаются (например
~%contract~). Это сделано чтобы можно было отдельно использовать поиск
по файлу не путаясь в сходно называемых, но по смыслу различных
вхождениях.

Сокращение необходимо, т.к. в сложных правилах я стремлюсь к
размещению группы похожих правил на одном экране.

Само название правила и терминалов внутри кода начинается с ~%~.

Если правило является подчиненным, оно определяется в подразделе. Это
позволяет группировать правила с соответствующими им тестами.

* Frame

Я буду делать этот проект как композицию компонентов, главными из которых
являются лексер и парсер.

В качестве тестирования я буду подавать на вход файл с валидными
solidity-конструкциями и ожидаю получить дерево разбора на выходе.

#+BEGIN_SRC lisp :tangle result.lisp :noweb tangle :comments noweb
  ;; <<copyright>>
  (eval-when (:compile-toplevel :load-toplevel :execute)
    (ql:quickload '(:yacc :cl-lex :alexandria :anaphora)))

  (use-package '(:cl :yacc :cl-lex :alexandria :anaphora))

  (defmacro bprint (var)
    `(subseq (with-output-to-string (*standard-output*)
               (pprint ,var)) 1))

  (defun lddr (par)
    (if (equal 2 (length par))
        (cons (car par) (lddr (cadr par)))
        par))

  <<dbgout>>

  <<deleting_comments>>

  <<lexer>>

  <<parser>>

  ;; (progn
  ;;   (defparameter *clj* (sol-lexer (read-file-into-string "result_test.sol")))
  ;;   (let ((result (parse-with-lexer *clj* *sol-parser*)))
  ;;     ;; (format t "~{~%~A~}" result)
  ;;     ;; (lddr result)
  ;;     (print result)
  ;;     ))

  <<tests>>
#+END_SRC

** System

Файл определения системы содержит в себе определение системы:
- библиотеки, от которых зависит система
- набор всех файлов, который должны быть загружены в образ.

Определение системы экпортируется из литературного исходника в
корневой каталог проекта.

#+NAME: defsystem
#+BEGIN_SRC lisp :tangle solipsism.asd :noweb tangle :exports code :padline no :comments link
  ;; <<copyright>>
  (asdf:defsystem #:solipsism
    :version      "0.0.1"
    :author       "rigidus <i.am.rigidus@gmail.com>"
    :licence      "AGPLv3"
    :description  "solipsism"
    :depends-on   (#:yacc #:cl-lex #:alexandria #:anaphora)
    :serial       t
    :components   ((:file "result.lisp")))
#+END_SRC

** Copyright

Копирайт вставляется в каждый сгенерированный файл для того чтобы
соблюсти требования лицензии AGPL

#+NAME: copyright
#+BEGIN_SRC lisp
  Copyright © 2021-2022 Glukhov Mikhail. All rights reserved. Licensed
  under the GNU AGPLv3
#+END_SRC

** Executable

#+BEGIN_SRC lisp :tangle exec.lisp
  (load "result.lisp")

  (ql:quickload "unix-opts")

  (load "mw-diff-sexp/packages.lisp")
  (load "mw-diff-sexp/diff-sexp.lisp")

  (use-package :mw-diff-sexp)

  (defun parse-filename (str)
    str)

  (opts:define-opts
    (:name :usage
     :description "Usage solidity checker."
     :short #\u
     :long "usage")
    (:name :parse
     :description "Parse solidity file"
     :short #\p
     :long "parse"
     ;; :required t
     :arg-parser #'parse-filename
     :meta-var "<filename>")
    (:name :test
     :description "Parse all files in test directory"
     :short #\t
     :long "test"
     ;; :required t
     :arg-parser #'parse-filename
     :meta-var "<directory>")
    (:name :output
     :description "Output file"
     :short #\o
     :long "output"
     ;; :required t
     :arg-parser #'parse-filename
     :meta-var "<filename>")
    (:name :compare
     :description "Compare contract"
     :short #\c
     :long "compare"
     ;; :required t
     :arg-parser #'parse-filename
     :meta-var "<filename>")
    ;; -------------------------------------
    (:name :check
     :description "Contract for checking"
     :short #\c
     :long "check"
     ;; :required t
     :arg-parser #'parse-filename
     :meta-var "<filename>")
    )

  (defun unknown-option (condition)
    (format t "WARNING: ~s option is unknown!~%~%" (opts:option condition))
    (invoke-restart 'opts:skip-option))

  (defmacro when-option ((options opt) &body body)
    `(let ((it (getf ,options ,opt)))
       (when it
         ,@body)))

  (defun main ()
    (multiple-value-bind (options free-args)
        (handler-case
            (handler-bind ((opts:unknown-option #'unknown-option))
              (opts:get-opts))
          (opts:missing-arg (condition)
            (format t "FATAL: option ~s needs an argument!~%~%"
                    (opts:option condition)))
          (opts:arg-parser-failed (condition)
            (format t "FATAL: cannot parse ~s as argument of ~s~%~%"
                    (opts:raw-arg condition)
                    (opts:option condition)))
          (opts:missing-required-option (con)
            (format t "FATAL: ~a~%%" con)
            (opts:exit 1)))
      (if (null options)
          (setf options '(:usage t)))
      (let ((parsed)
            (overbox))
        (when-option (options :usage)
          (opts:describe
           :prefix "Solidity checker. Usage:"
           :suffix "To find differences between the base contract and the checked one, use: solcheck -p base.sol -c checked.sol"
           :usage-of "./solcheck"
           ;; :args "[keywords]"
           ))
        (when-option (options :parse)
          (format t "Solidity checker. Parse file: ~A ~%" it)
          (setf parsed (test-contract-file it)))
        (when-option (options :test)
          (format t "Solidity checker. Test in directory: ~A ~%" it)
          (setf parsed (test-all-contracts it)))
        (when-option (options :output)
          (format t "Solidity checker. Output: ~A ~%" it)
          (setf overbox it))
        (when-option (options :compare)
          (format t "Solidity checker. Compare with: ~A ~%" it)
          (setf parsed
                (diff-sexp parsed (test-contract-file it))))
        ;; output
        (if overbox
            (alexandria:write-string-into-file (bprint parsed) overbox :if-exists :supersede)
            ;; else
            (format t "~%~A~%" (bprint parsed)))
        )))

  (export 'main)
  (sb-ext:save-lisp-and-die #P"solcheck" :toplevel #'main :executable t)
#+END_SRC

* Deleting comments

#+BEGIN_SRC lisp :noweb-ref deleting_comments
  (defun get-filtered-file-content (file filter)
    (let ((output (make-string-output-stream)))
      (with-open-file (input file)
        (loop :for line = (read-line input nil)
              :while line
              :do (write-line (funcall filter line) output)))
      (get-output-stream-string output)))

  (define-condition get-filtered-file-content-error (error)
    ((text :initarg :text :reader text)))

  (let ((state :no-comment))
    (defun clear-filter-comments ()
      (setf state :no-comment))
    (defun filter-comments (line)
      (macrolet ((add-acc () `(setf acc (concatenate 'string acc (coerce (list char) 'string))))
                 (restore () `(setf acc (concatenate 'string acc "/"))))
        (loop :for char :across line
              :with acc = ""
              :finally
                 (progn (when (equal state :candidate) ;; last symbol before end of line
                          (restore)
                          (setf state :no-comment)) ;; clear for next call
                        (return acc))
              :do
                 (cond ((equal state :no-comment)
                        (if (char= #\/ char)
                            (setf state :candidate) ;; then
                            (add-acc)))
                       ((equal state :candidate)
                        (cond ((char= #\/ char) ;; single-line comment
                               (progn
                                 (setf state :no-comment)
                                 (loop-finish))) ;; cut acc
                              ((char= #\* char) ;; multi-line comment
                               (progn
                                 (setf state :multi-line-comment)))
                              (t (progn
                                   (setf state :no-comment)
                                   (restore)
                                   (add-acc)))))
                       ((equal state :multi-line-comment)
                        (cond ((char= #\* char)
                               (setf state :maybe-fin))))
                       ((equal state :maybe-fin)
                        (cond ((char= #\/ char)
                               (setf state :no-comment))
                              (t (setf state :multi-line-comment))))
                       (t (error 'get-filtered-file-content-error :text (symbol-name state))))))))

  (defun get-filtered-comments-file-contents (file)
    (clear-filter-comments)
    (get-filtered-file-content file #'filter-comments))

  ;; (get-filtered-comments-file-contents #P"/home/rigidus/src/solipsism/test_contract.sol")
#+END_SRC

* Tests

Для тестирования будем генерировать файлы с Solidity-кодом в подпапках
папки ~./tests~.

При тестировании мы будем пробегаться по каждому из них и передавать в
парсер. Если возникнет какая-то ошибка - процесс тестирования остановится
и мы увидим, что произошло.

#+NAME: tests
#+BEGIN_SRC lisp
  (defun map-subdir (test-dir test-fn)
    (let ((test-subdirs))
      (uiop:collect-sub*directories
       test-dir
       (constantly t)
       (constantly t)
       (lambda (it) (push it test-subdirs)))
      (mapcar test-fn
              test-subdirs)))

  (defun map-subdir-files (test-dir test-fn)
    (let ((test-files))
      (map-subdir test-dir
                  #'(lambda (subdir)
                      (mapcar #'(lambda (x)
                                  (push x test-files))
                              (uiop:directory-files
                               (car (uiop:directory* subdir))))))
      (mapcar test-fn
              (reverse test-files))))

  ;; run-tests
  (defun test-all (dir)
    (map-subdir-files
     dir
     #'(lambda (file)
         (print file)
         (let* ((clj-lex (sol-lexer (get-filtered-comments-file-contents file))))
           (print (parse-with-lexer clj-lex *sol-parser*))))))

  (defun test-all-contracts (dir)
    (let ((result))
      (map-subdir-files
       dir
       #'(lambda (file)
           (push `(:file ,file) result)
           (let* ((clj-lex (sol-lexer (get-filtered-comments-file-contents file))))
             (push (parse-with-lexer clj-lex *sol-parser*) result))))
      (reverse result)))

  ;; Вариант для тестирования конкретного файла
  (defun test-file (pathname)
    (funcall #'(lambda (file)
                 (print file)
                 (let* ((clj-lex (sol-lexer (get-filtered-comments-file-contents file))))
                   (print (parse-with-lexer clj-lex *sol-parser*))))
             pathname))

  ;; Вариант для тестирования тестового контракта
  (defun test-contract-file (pathname)
    (funcall #'(lambda (file)
                 (let* ((clj-lex (sol-lexer (get-filtered-comments-file-contents file))))
                   (parse-with-lexer clj-lex *sol-parser*)))
             pathname))

  ;; (test-all "./tests")
  ;; (test-file #P"./tests/test_lib_def.sol")
  ;; (test-file #P"./tests/test_ctract_def.sol")
  ;; (test-file #P"./tests/test_ctract_body_elt.sol")
  ;; (test-file #P"./tests/test_simple_func_def.sol")
  ;; (test-file #P"./tests/test_func_with_param.sol")
  ;; (test-file #P"./tests/test_func_with_params.sol")
  ;; (test-file #P"./tests/test_fn_prm_type_id.sol")
  ;; (test-file #P"./tests/test_fn_prms_type_id.sol")
  ;; (test-file #P"./tests/test_fn_prms_type_loc.sol")
  ;; (test-file #P"./tests/test_fn_prms_type_loc_id.sol")
  ;; (test-file #P"./tests/test_fn_returns.sol")
  ;; (test-file #P"./tests/test_fn_visibility.sol")
  ;; (test-file #P"./tests/test_fn_state_mutability.sol")
  ;; (test-file #P"./tests/test_fn_virtual.sol")
  ;; (test-file #P"./tests/test_fn_mod_inv.sol")
  ;; (test-file #P"./tests/test_fn_override.sol")
  ;; (test-file #P"./tests/test_fn_block.sol")
  ;; (test-file #P"./tests/test_state_var_decl.sol")
  ;; (test-file #P"./tests/test_non_empty_str.sol")
  ;; (test-file #P"./tests/test_fn_type_name.sol")
  ;; (test-file #P"./tests/test_constructor.sol")
  ;; (test-file #P"./tests/test_expr_idx_stmnt.sol")
  ;; (test-file #P"./tests/test_modifier.sol")
  ;; (test-file #P"./tests/test_hexnum.sol")
  ;; (test-file #P"./tests/test_bool_lit.sol")
  ;; (test-file #P"./tests/test_mapping.sol")
  ;; (test-file #P"./tests/test_iface_def.sol")
  ;; (test-file #P"./tests/test_revert_stmnt.sol")
  ;; (test-file #P"./tests/test_fallback.sol")
  ;; (test-file #P"./tests/test_receive.sol")
  ;; (test-file #P"./tests/test_struct.sol")
  ;; (test-file #P"./tests/test_enum.sol")
  ;; (test-file #P"./tests/test_user_def_type.sol")
  ;; (test-file #P"./tests/test_error_def.sol")
  ;; (test-file #P"./tests/test_event_def.sol")
  ;; (test-file #P"./tests/test_try_catch_stmnt.sol")
  ;; (test-file #P"./tests/test_inline_arr_expr.sol")
  ;; (test-file #P"./tests/test_using_def.sol")
  ;; (test-file #P"./tests/test_const_def.sol")
  ;; (test-file #P"./tests/test_break_stmnt.sol")
  ;; (test-file #P"./tests/test_continue_stmnt.sol")C
  ;; (test-file #P"./tests/test_yul_block.sol")
  ;; (test-file #P"./tests/test_yul_var_decl.sol")
  ;; (test-file #P"./tests/test_yul_funccall.sol")
  ;; (test-file #P"./tests/test_yul_bool_lit.sol")
  ;; (test-file #P"./tests/test_yul_hexnum.sol")
  ;; (test-file #P"./tests/test_yul_dec_lit.sol")
  ;; (test-file #P"./tests/test_yul_str_lit.sol")
  ;; (test-file #P"./tests/test_yul_assignmt.sol")
  ;; (test-file #P"./tests/test_yul_if.sol")
  ;; (test-file #P"./tests/test_yul_func_def.sol")
  ;; (test-file #P"./tests/test_yul_for.sol")
  ;; (test-file #P"./tests/test_yul_switch.sol")
  ;; (test-file #P"./tests/test_yul_leave_break_continue.sol")

  ;; (test-contract-file #P"./test_contract.sol")
  ;; (test-contract-file #P"./test_dbg.sol")
  ;; (test-contract-file #P"./tests/test_dbg2.sol")

  ;; (test-all "./contracts")

  ;;; Вариант для получения списка всех лексем конкретного файла
  ;; (let* ((file #P"./tests/test_fn_mod_inv.sol")
  ;;        (contents (read-file-into-string file))
  ;;        (clj (sol-lexer contents)))
  ;;   (print contents)
  ;;   (tagbody
  ;;    repeat
  ;;      (multiple-value-bind (one two)
  ;;          (funcall clj)
  ;;        (format t "~%~A : ~A" one (bprint two))
  ;;        (when one
  ;;          (go repeat)))
  ;;      'fin))
#+END_SRC

* Lexer

Минимальный лексер - это просто функция, которая возвращает замыкание. А
парсер уже вызывает это замыкание каждый раз когда хочет получить
следующий токен. Замыкание при каждом вызове возвращает пару значений -
тип токена и его значение.

