doc.org
*** Fmeta

Следующая важная часть - это то, что в определении функции может
находиться между параметрами функции и возвращаемыми значениями. Там
может быть следующее:
- visibility
- state-mutability
- modifier-invocation
- virtual
- override-specifier

Все эти вещи могут быть вместе или по-отдельности, и все они
необязательны, поэтому лучше их вынести в отдельное мета-правило:

#+BEGIN_SRC lisp :noweb-ref func_def_contents
  (%function %identifier %parlist %fmeta %retlist %block
             #'(lambda (fun id parlist fmeta retlist blk)
                 `(:fun ,id :parlist ,parlist :fmeta ,fmeta :retlist ,retlist
                   :block ,blk)))

  (%function %identifier %parlist %fmeta %block
             #'(lambda (fun id parlist fmeta blk)
                 `(:fun ,id :parlist ,parlist :fmeta ,fmeta :block ,blk)))

#+END_SRC

Эта мета правило является рамочным правилом для всех выше перечисленных
пунктов во всех возможных комбинациях:

#+BEGIN_SRC lisp :noweb yes :noweb-ref grammar_rules
  (%fmeta
   <<fmeta-combination()>>
   )
#+END_SRC

Все эти комбинации генерируются в tangle-time:

#+NAME: fmeta-combination
#+BEGIN_SRC elisp :results output :tangle generator.el
  (require 'cl)

  (defun accommodations (in)
    (if (equal 1 (length in))
        (list in)
      (loop
       for item in in
       append (let* ((res)
                     (rest (remove item in))
                     (rets (accommodations rest)))
                (loop for ret in rets do
                      (push ret res)
                      (push (append (list item) ret) res))
                res))))

  (defun gen-accmd (in)
    (let ((res (remove-duplicates (accommodations in) :test #'equal)))
      ;; (length res))
      (loop for item in res do
            (let ((short-list (mapcar #'(lambda (item)
                                          (substring (symbol-name item) 1 4))
                                      item)))
              (princ (format "(%s\n  #'(lambda %s\n      %s\n"
                             (mapconcat #'(lambda (it)
                                            (symbol-name it))
                                        item " ")
                             short-list
                             (concat "`("
                                     (mapconcat #'(lambda (item)
                                                    (concat " :"
                                                            (substring (symbol-name item) 1) " ,"
                                                            (substring (symbol-name item) 1 4) " "))
                                                item "")
                                     ")))")))))))

  (gen-accmd
   '(%visibility %state-mutability %modifier-invocation %virtual %override-specifier))
#+END_SRC

**** Visibility

Начнем с visibility. Есть четыре варианта, которые мы должны добавить в
лексер:

#+BEGIN_SRC lisp :noweb-ref lexer_tokens
  ("\\binternal\\b" '%visibility 'internal)
  ("\\bexternal\\b" '%visibility 'external)
  ("\\bprivate\\b"  '%visibility 'private)
  ("\\bpublic\\b"   '%visibility 'public)
#+END_SRC

%visibility - это терминал, его надо добавить в список терминалов:

#+BEGIN_SRC lisp :noweb-ref grammar_terminals
  %visibility
#+END_SRC

Попробуем написать тест:

#+BEGIN_SRC solidity :tangle tests/test_fn_visibility.sol :mkdirp yes :noweb yes
  contract test_fn_visibility
  {
      function fn_1 (uint p_one, int p_two) external returns (uint r_one) ;
      function fn_2 (uint p_one, int p_two) internal returns (uint r_one) ;
      function fn_2 (uint p_one, int p_two) internal ;
  }
#+END_SRC

**** StateMutability

Следующий модификатор - state-mutability. Так как payable встречается в других конструкциях, мы должны добавить их в лексер

#+BEGIN_SRC lisp :noweb-ref lexer_tokens
  ("\\bpure\\b" '%pure 'pure)
  ("\\bview\\b" '%view 'view)
  ("\\bpayable\\b" '%payable 'payable)
#+END_SRC

#+BEGIN_SRC lisp :noweb-ref grammar_terminals
  %pure
  %view
  %payable
#+END_SRC

И нам нужно правило, которое позволит объединить их под общим "брендом":

#+BEGIN_SRC lisp :noweb-ref grammar_rules
  (%state-mutability
   (%pure    #'(lambda (x) `(:state-mutability ,x)))
   (%view    #'(lambda (x) `(:state-mutability ,x)))
   (%payable #'(lambda (x) `(:state-mutability ,x)))
   )
#+END_SRC

Тест:

#+BEGIN_SRC solidity :tangle tests/test_fn_state_mutability.sol :mkdirp yes :noweb yes
  contract test_fn_state_mutability
  {
      function fn_1 (uint p_one, int p_two) external view returns (uint r_one) ;
      function fn_2 (uint p_one, int p_two) internal payable returns (uint r_one) ;
      function fn_3 (uint p_one, int p_two) external view returns (uint r_one) ;
      function fn_4 (uint p_one, int p_two) view private returns (uint r_one) ;
  }
#+END_SRC

**** Virtual

Следующий модификатор - virtual. У него в лексере только один вариант:

#+BEGIN_SRC lisp :noweb-ref lexer_tokens
  ("\\bvirtual\\b" '%virtual 'virtual)
#+END_SRC

Добавляем в список терминалов:

#+BEGIN_SRC lisp :noweb-ref grammar_terminals
  %virtual
#+END_SRC

Тест:

#+BEGIN_SRC solidity :tangle tests/test_fn_virtual.sol :mkdirp yes :noweb yes
  contract test_fn_virtual
  {
      function fn_1 (uint p_one, int p_two) virtual returns (uint r_one) ;
      function fn_2 (uint p_one, int p_two) internal virtual returns (uint r_one) ;
      function fn_3 (uint p_one, int p_two) virtual external view returns (uint r_one) ;
      function fn_4 (uint p_one, int p_two) view private virtual returns (uint r_one) ;
  }
#+END_SRC

**** ModifierInvocation

Следующий модификатор - modifier-invocation. Он тянет за собой
call-argument-list, поэтому нам понадобится раскрывающее правило:

#+BEGIN_SRC lisp :noweb-ref grammar_rules
  (%modifier-invocation
   (%ident-path #'(lambda (ip) `(:ident-path ,ip)))
   (%ident-path %call-arg-list
                #'(lambda (ip args) `(:id-path ,ip :args ,args)))
   )
#+END_SRC

Тест:

#+BEGIN_SRC solidity :tangle tests/test_fn_mod_inv.sol :mkdirp yes :noweb yes
  contract test_fn_mod_inv
  {
      function fn_1 (uint p_one) isOk returns (uint r_one) ;
      function fn_1 (uint p_one) Obj.isOk returns (uint r_one) ;
      function fn_1 (uint p_one) isOk() returns (uint r_one) ;
      function fn_2 (uint p_one) Obj.isOk() returns (uint r_one) ;
      function fn_3 (uint p_one) One.Two.isOk() returns (uint r_one) ;
  }
#+END_SRC

**** OverrideSpecifier

Следующий модификатор - override-specifier. Он тянет за собой
multi-identifier-path, поэтому нам понадобится раскрывающее правило:

#+BEGIN_SRC lisp :noweb-ref grammar_rules
  (%override-specifier
   (%override #'(lambda (ovr) `(:override nil)))
   (%override |%(| %multi-ident-path |%)| #'(lambda (ovr lb mip rb) `(:override ,mip)))
   )
#+END_SRC

Теперь надо добавить |%override| в список лексем

#+BEGIN_SRC lisp :noweb-ref lexer_tokens
  ("\\boverride" '%override '%override)
#+END_SRC

и терминалов

#+BEGIN_SRC lisp :noweb-ref grammar_terminals
  %override
#+END_SRC

Тест:

#+BEGIN_SRC solidity :tangle tests/test_fn_override.sol :mkdirp yes :noweb yes
  contract test_fn_override
  {
      function fn_1 (uint p_one) override returns (uint r_one) ;
      function fn_1 (uint p_one) override(Base1, Obj.Base2) returns (uint r_one) ;
  }
#+END_SRC

** IdentifierPath and Identifier

Используется в вызовах всего чего угодно, если там применима точечная
нотация: [[*ContractDefinition][ContractDefinition]], [[*ModifierInvocation][ModifierInvocation]].

#+BEGIN_SRC lisp :noweb-ref grammar_rules
  (%ident-path
   (%ident #'(lambda (last) `(:ident (,last))))
   (%ident |%.| %ident-path
           #'(lambda (head dot rest)
               `(:ident ,(append (list head) (cadr rest)))))
   )
  (%ident
   (%identifier #'(lambda (id) `(:id ,id)))
   (%from #'(lambda (fr) `(:from ,fr)))
   ;; (%error #'(lambda (er) `(:error ,er)))
   ;; (%revert #'(lambda (rv) `(:revert ,rv)))
   )
  (%multi-ident-path
   (%ident-path #'(lambda (id) `(:id ,id)))
   (%ident-path |%,| %multi-ident-path #'(lambda (id cm mip) `(:id-head ,id :id-rest ,mip)))
   )
#+END_SRC

[TODO:gmm] - Test

** TypeName

A type name can be an elementary type, a function type, a mapping
type, a user-defined type (e.g. a contract or struct) or an array
type.

NB: Опережающая ссылка на elt-type-name (ElementaryTypeName)

NB: Закомментированое определение конфликтует с [[*Inline-array-expression][Inline-array-expression]]

----- Разбор проблемы ------

Type name определяется как ~new some_shit [smth]~, а inline-array-expr
определяется как ~smth = [smth]~.

И то, и то - это варианты expr. Ключевое здесь - это слово ~new~, которое
обнозначно должно указывать парсеру, что ща будет тайп-нейм. Но конфликт
возникает в smth = [smth] на символе ~=~ - парсер говорит, что хочет [,
идентифаер или data-location. Ожидаемый символ [ намекает, что парсер
считал выражение как typeName.

~Гипотеза 1:~
Парсер читает токен smth и понимает, что это ident.
А дальше есть несколько правил, и первое подходящее - type-name. Дальше
он ждет [, а получает =.

~Не подтвердилась~, потому что если поместить определение inline-array-expr
в expr выше, чем type-name, тест на inline-array-expr все равно
валится. Хотя не должен.


~Как работает парсер, порожденный yacc~
Согласно вот этому:
https://www.epaperpress.com/lexandyacc/thy.html
https://ita.sibsutis.ru/sites/csc.sibsutis.ru/files/courses/trans/LabWork4.pdf
http://www.cs.man.ac.uk/~pjj/cs212/ho/node20.html


Скорее всего парсер, порожденный yacc - это LALR(1)-парсер, т.е. в случае
неоднозначности того, к какому правилу отнести токен, он прочитает
максимум 1 символ дальше.

Прочитанные токены кладутся на стек, как только находится правило,
которое соответствует этому набору токенов, токены "сворачиваются" в
соответсвующий нетерминал. И так до тех пор, пока мы не восходим к
корневому нетерминалу гармматики. На стеке при этом не должно оставаться
лишних символов.

Есть два типа конфликтов, которые могут возникать:
- ~shift-reduce~
- ~reduce-reduce~

~shift-reduce~ конфликт возникает, когда у нас есть 2 (или более правил),
где одно правило полностью повторяет начало (n символов сначала) другого правила. Мы
знаем, что парсер складывает токены на стеке и сворачивает их в нетерминал,
как только это становится доступным, и в случае данного конфликта то, как
он свернет (reduce) прочитанное в нетерминал, зависит от того, прочитает он
следующий символ (т.е. сделает shift, сдвинется на 1 символ дальше во
входном потоке токенов), или нет. Поэтому нужно заранее определить, как
будет поступать парсер в данном случае - будет читать символ дальше или
нет.
Более полное объяснение тут
https://www.gnu.org/software/bison/manual/html_node/Reduce_002fReduce.html
Yacc в случае такого конлфикта сдвинется на 1 сивол дальше.

~reduce-reduce~ конфликт возникает, когда 2 или более правил могут быть
применены к одной и той же последовательности токенов.
См. полное объяснение тут:
https://www.gnu.org/software/bison/manual/html_node/Reduce_002fReduce.html
Yacc в случае такого конфликта применит правило, которое первым
определено в грамматике.

---- Возможное объяснение конфликта ----

Фишка в том, type-name - это не только про объявление нового типа - тогда мы
используем ключевое слово ~new~ и такая контрукция является частью ~expr~
и парсер однозначно определяет, что речь про type-name - а про
использование любого типа в принципе.

То есть он может быть как address[some_shit] и тогда это становится неотличимым от
inline-array-expr. Прикол в том, что inline-array-expr - это часть expr,
а вот type-name БЕЗ new - нет. То есть после inline-array-expr может
идти |=|, потому что в expr есть такое правило:

#+BEGIN_SRC lisp
  (%expr |%=|     %expr #'(lambda (e1 op e2) `(:expr-eq   ,e1 :arg ,e2)))
#+END_SRC

А вот после type-name не может.

type-name - это конструкция, которая встречается ТОЛЬКО в составе других
правил и как самостоятельное выражение использоваться НЕ МОЖЕТ.

То есть вот так type-name не может использоватьcя:
#+BEGIN_SRC solidity
  library Strings {
      function test()    {
          // это type-name
          buffer[elt];
      }
  }
#+END_SRC

Есть пройтись по грамматике от source-unit, то видно, что
expression(частью которого является inline-array-expr) и
type-name первый раз встречатся на одном уровне "вложенности" правил в
constant-variable-declaration. То есть я предполагаю, что в иерарзии
языка эти нетерминалы находятся на одном уровне.

В result.lisp определения идут в следующем порядке:
 - определение %type-name
 - определение %expr
 - определение %inline-array-expr

Предположим, парсер разбирает выражение:

#+BEGIN_SRC solidity
  buffer[elt] = smth;
#+END_SRC

Он должен понять, что это inline-array-expr.
Он читает ~buffer[elt]~ и дальше, как я предполагаю, у нас возникает
reduce-reduce конфликт.

С одной стороны у нас есть такие правила для type-name и inline-array-expr:

#+BEGIN_SRC lisp
  (%inline-array-expr
   (|%[| %expr-comma-list |%]| #'(lambda (lb ex rb) `(:inline-array-expr ,ex)))
   )

  (%type-name |%[| %expr |%]|
              #'(lambda (par lb ex rb) `(:type-name-expr ,par :t-array ,ex)))
#+END_SRC

Где expr-comma-list - это как одинарный expr, так и expr через запятую.
То есть у нас фактически два правила, которые обозначают одну и ту же
конструкицю - и это reduce-reduce конфликт. И тогда выбирается то
правило, которое определено первым - в нашем случае это type-name.

А дальше парсер читает |=| и не находит правила, где после type-name идет
такой токен.

Возможно эта гипотеза не верна.

Есть идея, как это решить:

#+BEGIN_SRC lisp :noweb-ref grammar_rules
  (%type-name
   (%elt-type-name #'(lambda (par) `(:elt-type-name ,par)))
   (%func-type-name #'(lambda (par) `(:func-type-name ,par)))
   (%mapping-type #'(lambda (par) `(:mapping-type ,par)))
   (%type-name %inline-array-expr
               #'(lambda (par inline-expr) `(:type-name ,par :type-name-expr ,inline-expr)))
   (%ident-path #'(lambda (par) `(:identifier-path ,par)))
   )

#+END_SRC

#+BEGIN_SRC solidity :tangle tests/test_type_name_with_array.sol :mkdirp yes :noweb yes
  pragma solidity ^0.8.0;
  library Strings {
      function test() {
          new buffer[elt] = njklasdv;
      }
  }
#+END_SRC

